# Usage: brew bundle --global --no-lock --cleanup
brew "asdf"
brew "aws-cdk"
brew "awscli"
brew "bash"
brew "colordiff"
brew "curl"
brew "emacs"
brew "ffmpeg"
brew "git-crypt"
brew "git"
brew "go"
brew "graphviz"
brew "gsed"
brew "hadolint"
brew "imagemagick"
brew "jq"
brew "ncdu"
brew "nkf"
brew "parquet-tools"
brew "peco"
brew "poetry"
brew "pwgen"
brew "ripgrep"
brew "shared-mime-info"
brew "sheldon"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "wget"
brew "yarn"
brew "zlib"
brew "zsh-completions"
brew "zsh"
cask "battery"
cask "dash"
cask "dbeaver-community"
cask "devtoys"
cask "finch"
cask "font-iosevka"
cask "font-monaspace"
cask "font-myrica"
cask "keyclu"
tap "beeftornado/rmtree"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "k1low/tap"
