# Usage:brew bundle --global --cleanup
brew "asdf"
brew "aws-cdk"
brew "awscli"
brew "bash"
brew "oven-sh/bun/bun"
brew "colordiff"
brew "coreutils"
brew "colima"
brew "curl"
brew "deck"
brew "direnv"
brew "exiftool"
brew "emacs"
brew "ffmpeg"
brew "git-crypt"
brew "git"
brew "gh"
brew "ghq"
brew "lazygit"
brew "go"
brew "graphviz"
brew "gsed"
brew "hadolint"
brew "imagemagick"
brew "jq"
brew "laminate"
brew "libusb"
brew "libyaml"
brew "markdownlint-cli2"
brew "ncdu"
brew "nkf"
brew "ollama"
brew "openfortivpn"
brew "openjdk"
brew "fd"
brew "fzy"
brew "pkg-config"
brew "plantuml"
brew "poetry"
brew "postgresql"
brew "pwgen"
brew "ripgrep"
brew "rmtrash"
brew "yazi"
brew "shared-mime-info"
brew "sheldon"
brew "starship"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "satococoa/tap/wtp"
brew "yarn"
brew "zlib"
brew "zsh-completions"
brew "zsh"
brew "handbrake"
cask "alacritty"
cask "battery"
cask "ghostty@tip"
cask "dash"
cask "codex"
cask "dbeaver-community"
cask "visual-studio-code"
cask "font-iosevka"
cask "font-monaspace"
cask "font-myrica"
cask "keyclu"
cask "obs"
# cask "temurin"
cask "utm"
cask "xquartz"
tap "beeftornado/rmtree"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "k1low/tap"
tap "satococoa/tap"
tap "songmu/tap"
