# Usage: brew bundle --global --cleanup

# Taps
tap "beeftornado/rmtree"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "k1low/tap"
tap "oven-sh/bun"
tap "qmk/qmk"
tap "satococoa/tap"
tap "songmu/tap"

# CLI tools
brew "bash"
brew "bat"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "glow"
brew "graphviz"
brew "gsed"
brew "imagemagick"
brew "jq"
brew "mas"
brew "ncdu"
brew "nkf"
brew "pkg-config"
brew "pwgen"
brew "ripgrep"
brew "rmtrash"
brew "shellcheck"
brew "terminal-notifier"
brew "tree"
brew "wget"
brew "zlib"

# Shell
brew "sheldon"
brew "starship"
brew "tmux"
brew "zellij"
brew "zsh"
brew "zsh-completions"

# Git
brew "gh"
brew "ghq"
brew "git"
brew "git-crypt"
brew "glab"
brew "lazygit"

# Dev tools
brew "mise"
brew "oven-sh/bun/bun"
brew "go"
brew "uv"
brew "poetry"
brew "openjdk"
brew "emacs"
brew "hadolint"
brew "markdownlint-cli2"
brew "plantuml"
brew "postgresql"

# Infrastructure
brew "awscli"
brew "aws-cdk"
brew "colima"
brew "deck"
brew "openfortivpn"

# AI
brew "ollama"

# Keyboard
brew "libusb"
brew "qmk/qmk/qmk"
brew "laminate"

# File manager
brew "yazi"
brew "exiftool"
brew "shared-mime-info"

# Other
brew "handbrake"
brew "libyaml"
brew "todoist-cli"
brew "worktrunk"
brew "satococoa/tap/wtp"
brew "yarn"

# GUI apps
cask "alacritty"
cask "battery"
cask "codex"
cask "dash"
cask "dbeaver-community"
cask "drawio"
cask "ghostty"
cask "keyclu"
cask "obs"
cask "utm"
cask "via"
cask "visual-studio-code"
cask "xquartz"
cask "zed"

# Fonts
cask "font-iosevka"
cask "font-monaspace"
cask "font-myrica"

# VS Code extensions
vscode "3w36zj6.textlint"
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "cweijan.vscode-office"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "mhutchie.git-graph"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "tuttieee.emacs-mcx"
vscode "vue.volar"
vscode "yzhang.markdown-all-in-one"
