tap "homebrew/core"
tap "homebrew/bundle"
tap "caskroom/cask"
brew "amazon-ecs-cli"
brew "autoconf"
brew "boost"
brew "cloog"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "diffutils"
brew "direnv"
brew "dnsmasq"
brew "emacs", args: ["with-gnutls"]
brew "gcc"
brew "gdbm"
brew "gettext", link: true
brew "global", args: ["with-ctags", "with-pygments"]
brew "gnutls"
brew "graphviz"
brew "jq"
brew "openssl"
brew "libevent"
brew "libxslt"
brew "markdown"
brew "md5sha1sum"
brew "mono"
brew "mysql"
brew "nginx"
brew "nkf"
brew "nmap"
brew "pandoc"
brew "peco"
brew "postgresql"
brew "putty"
brew "pwgen"
brew "pyenv"
brew "reattach-to-user-namespace"
brew "redis"
brew "rename"
brew "ripgrep"
brew "sqlite"
brew "sshrc"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "watchman"
brew "wget"
brew "xz"
brew "yajl"
brew "yarn"
brew "zsh"
brew "zsh-completions"
cask "dash"
cask "epichrome"
